УТ_для_edt/src/InformationRegisters/смартСтопЛистТехническойОтсрочки/смартСтопЛистТехническойОтсрочки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>смартСтопЛистТехническойОтсрочки</name>
  <comment>#4792 смарт: Тимофеева 17.03.26 / Контроль дебиторской задолженности. Реализация блокировки клиента. Техническая отсрочка. Этап 1</comment>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ПродажаОтгрузкаЗапрещена</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>СуммаЗадолженности</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>РасчетныйДокумент</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </attributes>
  <dimensions>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаказКлиента</name>
    <type>
      <types>DocumentRef.ЗаказКлиента</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/InformationRegisters/смартСтопЛистТехническойОтсрочки/Forms/ФормаСтопЛист/Module.bsl
/////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Партнер", Партнер);
	Параметры.Свойство("Контрагент", Контрагент);
	
	Список.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", ТекущаяДатаСеанса());
	
	Если ЗначениеЗаполнено(Партнер) Тогда
		ОтборыСписковКлиентСервер.УстановитьЭлементОтбораСписка(Список, "Партнер", Партнер);
		ОтборыСписковКлиентСервер.УстановитьЭлементОтбораСписка(СтопЛистЗаписи, "Партнер", Партнер);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Контрагент) Тогда
		ОтборыСписковКлиентСервер.УстановитьЭлементОтбораСписка(Список, "Контрагент", Контрагент);
		ОтборыСписковКлиентСервер.УстановитьЭлементОтбораСписка(СтопЛистЗаписи, "Контрагент", Контрагент);
	КонецЕсли;
	
	Элементы.СтопЛистЗаписи.Видимость = Ложь;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле.Имя = "СписокПартнер" Тогда
		ПоказатьЗначение(,Элементы.Список.ТекущиеДанные.Партнер);
	ИначеЕсли Поле.Имя = "СписокКонтрагент" Тогда
		ПоказатьЗначение(,Элементы.Список.ТекущиеДанные.Контрагент);
	ИначеЕсли Поле.Имя = "СписокЗаказКлиента" Тогда
		ПоказатьЗначение(,Элементы.Список.ТекущиеДанные.ЗаказКлиента);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Редактировать(Команда)

	ФормаРедактировать 					= Не Элементы.ФормаРедактировать.Пометка;
	Элементы.ФормаРедактировать.Пометка = ФормаРедактировать;
	Элементы.Список.Видимость 			= НЕ ФормаРедактировать;
	Элементы.СтопЛистЗаписи.Видимость 	= ФормаРедактировать;
	
КонецПроцедуры

#КонецОбласти

/////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
